m5stack/M5AtomS3/src/utility/In_eSPI_ESP32_S3.cpp
////////////////////////////////////////////////////
// TFT_eSPI driver functions for ESP32 processors //
////////////////////////////////////////////////////

// Temporarily a separate file to TFT_eSPI_ESP32.c until board package low level
// API stabilises

////////////////////////////////////////////////////////////////////////////////////////
// Global variables
////////////////////////////////////////////////////////////////////////////////////////
#include "In_eSPI_ESP32_S3.h"
#include "SPI.h"
#include "soc/spi_reg.h"

// Select the SPI port to use, ESP32 has 2 options
#if !defined(TFT_PARALLEL_8_BIT)
#ifdef CONFIG_IDF_TARGET_ESP32
#ifdef USE_HSPI_PORT
SPIClass spi = SPIClass(HSPI);
#elif defined(USE_FSPI_PORT)
SPIClass spi               = SPIClass(FSPI);
#else  // use default VSPI port
SPIClass spi               = SPIClass(VSPI);
#endif
#else
#ifdef USE_HSPI_PORT
SPIClass spi = SPIClass(HSPI);
#elif defined(USE_FSPI_PORT)
SPIClass spi = SPIClass(FSPI);
#else  // use FSPI port
SPIClass &spi = SPI;
#endif
#endif
#endif

#ifdef ESP32_DMA
// DMA SPA handle
spi_device_handle_t dmaHAL;
#ifdef CONFIG_IDF_TARGET_ESP32
#define DMA_CHANNEL 1
#ifdef USE_HSPI_PORT
spi_host_device_t spi_host = HSPI_HOST;
#elif defined(USE_FSPI_PORT)
spi_host_device_t spi_host = SPI_HOST;
#else  // use VSPI port
spi_host_device_t spi_host = VSPI_HOST;
#endif
#else
#ifdef USE_HSPI_PORT
#define DMA_CHANNEL 2
spi_host_device_t spi_host =
    (spi_host_device_t)DMA_CHANNEL;  // Draws once then freezes
#else  // use FSPI port
#define DMA_CHANNEL 1
spi_host_device_t spi_host =
    (spi_host_device_t)DMA_CHANNEL;  // Draws once then freezes
#endif
#endif
#endif

////////////////////////////////////////////////////////////////////////////////////////
#if defined(TFT_SDA_READ) && !defined(TFT_PARALLEL_8_BIT)
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           beginSDA
** Description:             Detach SPI from pin to permit software SPI
***************************************************************************************/
void TFT_eSPI::begin_SDA_Read(void) {
    pinMatrixOutDetach(TFT_MOSI, false, false);
    pinMode(TFT_MOSI, INPUT);
    pinMatrixInAttach(TFT_MOSI, VSPIQ_IN_IDX, false);
    SET_BUS_READ_MODE;
}

/***************************************************************************************
** Function name:           endSDA
** Description:             Attach SPI pins after software SPI
***************************************************************************************/
void TFT_eSPI::end_SDA_Read(void) {
    pinMode(TFT_MOSI, OUTPUT);
    pinMatrixOutAttach(TFT_MOSI, VSPID_OUT_IDX, false, false);
    pinMode(TFT_MISO, INPUT);
    pinMatrixInAttach(TFT_MISO, VSPIQ_IN_IDX, false);
    SET_BUS_WRITE_MODE;
}
////////////////////////////////////////////////////////////////////////////////////////
#endif  // #if defined (TFT_SDA_READ)
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           read byte  - supports class functions
** Description:             Read a byte from ESP32 8 bit data port
***************************************************************************************/
// Parallel bus MUST be set to input before calling this function!
uint8_t TFT_eSPI::readByte(void) {
    uint8_t b = 0xAA;

#if defined(TFT_PARALLEL_8_BIT)
    RD_L;
    uint32_t reg;            // Read all GPIO pins 0-31
    reg = gpio_input_get();  // Read three times to allow for bus access time
    reg = gpio_input_get();
    reg = gpio_input_get();  // Data should be stable now
    RD_H;

    // Check GPIO bits used and build value
    b = (((reg >> TFT_D0) & 1) << 0);
    b |= (((reg >> TFT_D1) & 1) << 1);
    b |= (((reg >> TFT_D2) & 1) << 2);
    b |= (((reg >> TFT_D3) & 1) << 3);
    b |= (((reg >> TFT_D4) & 1) << 4);
    b |= (((reg >> TFT_D5) & 1) << 5);
    b |= (((reg >> TFT_D6) & 1) << 6);
    b |= (((reg >> TFT_D7) & 1) << 7);
#endif

    return b;
}

////////////////////////////////////////////////////////////////////////////////////////
#ifdef TFT_PARALLEL_8_BIT
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           GPIO direction control  - supports class functions
** Description:             Set parallel bus to INPUT or OUTPUT
***************************************************************************************/
void TFT_eSPI::busDir(uint32_t mask, uint8_t mode) {
    // Arduino generic native function
    pinMode(TFT_D0, mode);
    pinMode(TFT_D1, mode);
    pinMode(TFT_D2, mode);
    pinMode(TFT_D3, mode);
    pinMode(TFT_D4, mode);
    pinMode(TFT_D5, mode);
    pinMode(TFT_D6, mode);
    pinMode(TFT_D7, mode);
}

/***************************************************************************************
** Function name:           GPIO direction control  - supports class functions
** Description:             Set ESP32 GPIO pin to input or output (set high)
*ASAP
***************************************************************************************/
void TFT_eSPI::gpioMode(uint8_t gpio, uint8_t mode) {
    pinMode(gpio, mode);
    digitalWrite(gpio, HIGH);
}
////////////////////////////////////////////////////////////////////////////////////////
#endif  // #ifdef TFT_PARALLEL_8_BIT
////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////
#if defined(RPI_WRITE_STROBE) && \
    !defined(TFT_PARALLEL_8_BIT)  // Code for RPi TFT
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32 or ESP8266 RPi TFT
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len) {
    uint8_t colorBin[] = {(uint8_t)(color >> 8), (uint8_t)color};
    if (len) spi.writePattern(&colorBin[0], 2, 1);
    len--;
    while (len--) {
        WR_L;
        WR_H;
    }
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32 or ESP8266 RPi TFT
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void *data_in, uint32_t len) {
    uint8_t *data = (uint8_t *)data_in;

    if (_swapBytes) {
        while (len--) {
            tft_Write_16(*data);
            data++;
        }
        return;
    }

    while (len >= 64) {
        spi.writePattern(data, 64, 1);
        data += 64;
        len -= 64;
    }
    if (len) spi.writePattern(data, len, 1);
}

////////////////////////////////////////////////////////////////////////////////////////
#elif !defined(SPI_18BIT_DRIVER) && \
    !defined(TFT_PARALLEL_8_BIT)  // Most SPI displays
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
/*
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len){

  uint32_t color32 = (color<<8 | color >>8)<<16 | (color<<8 | color >>8);
  bool empty = true;
  volatile uint32_t* spi_w = (volatile uint32_t*)_spi_w;
  if (len > 31)
  {
    *_spi_mosi_dlen =  511;
    spi_w[0]  = color32;
    spi_w[1]  = color32;
    spi_w[2]  = color32;
    spi_w[3]  = color32;
    spi_w[4]  = color32;
    spi_w[5]  = color32;
    spi_w[6]  = color32;
    spi_w[7]  = color32;
    spi_w[8]  = color32;
    spi_w[9]  = color32;
    spi_w[10] = color32;
    spi_w[11] = color32;
    spi_w[12] = color32;
    spi_w[13] = color32;
    spi_w[14] = color32;
    spi_w[15] = color32;
    while(len>31)
    {
      while ((*_spi_cmd)&SPI_USR);
      *_spi_cmd = SPI_USR;
      len -= 32;
    }
    empty = false;
  }

