m5stack/M5AtomS3/src/utility/In_eSPI_ESP32_S3.cpp
  if (len)
  {
    if(empty) {
      for (uint32_t i=0; i <= len; i+=2) *spi_w++ = color32;
    }
    len = (len << 4) - 1;
    while (*_spi_cmd&SPI_USR);
    *_spi_mosi_dlen = len;
    *_spi_cmd = SPI_USR;
  }
  while ((*_spi_cmd)&SPI_USR); // Move to later in code to use transmit time
usefully?
}
//*/
//*
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len) {
    volatile uint32_t* spi_w = _spi_w;
    uint32_t color32 =
        (color << 8 | color >> 8) << 16 | (color << 8 | color >> 8);
    uint32_t i   = 0;
    uint32_t rem = len & 0x1F;
    len          = len - rem;

    // Start with partial buffer pixels
    if (rem) {
        while (*_spi_cmd & SPI_USR)
            ;
        for (i = 0; i < rem; i += 2) *spi_w++ = color32;
        *_spi_mosi_dlen = (rem << 4) - 1;
#if CONFIG_IDF_TARGET_ESP32S3
        *_spi_cmd       = SPI_UPDATE;
        while (*_spi_cmd & SPI_UPDATE)
            ;
#endif
        *_spi_cmd = SPI_USR;
        if (!len) return;  //{while (*_spi_cmd&SPI_USR); return; }
        i = i >> 1;
        while (i++ < 16) *spi_w++ = color32;
    }

    while (*_spi_cmd & SPI_USR)
        ;
    if (!rem)
        while (i++ < 16) *spi_w++ = color32;
    *_spi_mosi_dlen = 511;

    // End with full buffer to maximise useful time for downstream code
    while (len) {
        while (*_spi_cmd & SPI_USR)
            ;
#if CONFIG_IDF_TARGET_ESP32S3
        *_spi_cmd = SPI_UPDATE;
        while (*_spi_cmd & SPI_UPDATE)
            ;
#endif
        *_spi_cmd = SPI_USR;
        len -= 32;
    }

    // Do not wait here
    // while (*_spi_cmd&SPI_USR);
}
//*/
/***************************************************************************************
** Function name:           pushSwapBytePixels - for ESP32
** Description:             Write a sequence of pixels with swapped bytes
***************************************************************************************/
void TFT_eSPI::pushSwapBytePixels(const void* data_in, uint32_t len) {
    uint8_t* data = (uint8_t*)data_in;
    uint32_t color[16];

    if (len > 31) {
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
        while (len > 31) {
            uint32_t i = 0;
            while (i < 16) {
                color[i++] = DAT8TO32(data);
                data += 4;
            }
            while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
                ;
            WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color[0]);
            WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color[1]);
            WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color[2]);
            WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color[3]);
            WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color[4]);
            WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color[5]);
            WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color[6]);
            WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color[7]);
            WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), color[8]);
            WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), color[9]);
            WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), color[10]);
            WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), color[11]);
            WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), color[12]);
            WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), color[13]);
            WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), color[14]);
            WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), color[15]);
#if CONFIG_IDF_TARGET_ESP32S3
            SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
            while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
                ;
#endif
            SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
            len -= 32;
        }
    }

    if (len > 15) {
        uint32_t i = 0;
        while (i < 8) {
            color[i++] = DAT8TO32(data);
            data += 4;
        }
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
            ;
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 255);
        WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color[0]);
        WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color[1]);
        WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color[2]);
        WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color[3]);
        WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color[4]);
        WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color[5]);
        WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color[6]);
        WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color[7]);
#if CONFIG_IDF_TARGET_ESP32S3
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
            ;
#endif
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
        len -= 16;
    }

    if (len) {
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
            ;
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
        for (uint32_t i = 0; i <= (len << 1); i += 4) {
            WRITE_PERI_REG(SPI_W0_REG(SPI_PORT) + i, DAT8TO32(data));
            data += 4;
        }
#if CONFIG_IDF_TARGET_ESP32S3
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
            ;
#endif
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
    }
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
        ;
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void* data_in, uint32_t len) {
    if (_swapBytes) {
        pushSwapBytePixels(data_in, len);
        return;
    }

    uint32_t* data = (uint32_t*)data_in;

    if (len > 31) {
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
        while (len > 31) {
            while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
                ;
            WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), *data++);
            WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), *data++);
#if CONFIG_IDF_TARGET_ESP32S3
            SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
            while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
                ;
#endif
            SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
            len -= 32;
        }
    }

    if (len) {
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
            ;
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
        for (uint32_t i = 0; i <= (len << 1); i += 4)
            WRITE_PERI_REG((SPI_W0_REG(SPI_PORT) + i), *data++);
#if CONFIG_IDF_TARGET_ESP32S3
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
            ;
#endif
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
    }
    while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
        ;
}

////////////////////////////////////////////////////////////////////////////////////////
#elif defined(SPI_18BIT_DRIVER)  // SPI 18 bit colour
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32 and 3 byte RGB display
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len) {
    // Split out the colours
    uint32_t r = (color & 0xF800) >> 8;
    uint32_t g = (color & 0x07E0) << 5;
    uint32_t b = (color & 0x001F) << 19;
    // Concatenate 4 pixels into three 32 bit blocks
    uint32_t r0 = r << 24 | b | g | r;
    uint32_t r1 = r0 >> 8 | g << 16;
    uint32_t r2 = r1 >> 8 | b << 8;

    if (len > 19) {
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 479);

        while (len > 19) {
            while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
                ;
            WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), r2);
            WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), r2);
            WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), r2);
            WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), r2);
            WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), r2);
#if CONFIG_IDF_TARGET_ESP32S3
            SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
            while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
                ;
#endif
            SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
            len -= 20;
        }
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
            ;
    }

    if (len) {
        WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len * 24) - 1);
        WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), r0);
        WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), r1);
        WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), r2);
        WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), r0);
        WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), r1);
        WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), r2);
        if (len > 8) {
            WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), r2);
            WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), r2);
            WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), r0);
            WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), r1);
            WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), r2);
        }
#if CONFIG_IDF_TARGET_ESP32S3
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_UPDATE)
            ;
#endif
        SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
        while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
            ;
    }
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32 and 3 byte RGB display
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void* data_in, uint32_t len) {
    uint16_t* data = (uint16_t*)data_in;
    // ILI9488 write macro is not endianess dependant, hence !_swapBytes
    if (!_swapBytes) {
        while (len--) {
            tft_Write_16S(*data);
            data++;
        }
    } else {
        while (len--) {
            tft_Write_16(*data);
            data++;
        }
    }
}

/***************************************************************************************
** Function name:           pushSwapBytePixels - for ESP32 and 3 byte RGB
*display
** Description:             Write a sequence of pixels with swapped bytes
***************************************************************************************/
void TFT_eSPI::pushSwapBytePixels(const void* data_in, uint32_t len) {
    uint16_t* data = (uint16_t*)data_in;
    // ILI9488 write macro is not endianess dependant, so swap byte macro not
    // used here
    while (len--) {
        tft_Write_16(*data);
        data++;
    }
}

////////////////////////////////////////////////////////////////////////////////////////
#elif defined(TFT_PARALLEL_8_BIT)  // Now the code for ESP32 8 bit parallel
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32 and parallel display
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len) {
    if ((color >> 8) == (color & 0x00FF)) {
        if (!len) return;
        tft_Write_16(color);
#if defined(SSD1963_DRIVER)
        while (--len) {
            WR_L;
            WR_H;
            WR_L;
            WR_H;
            WR_L;
            WR_H;
        }
#else
#ifdef PSEUDO_16_BIT
        while (--len) {
            WR_L;
            WR_H;
        }
#else
        while (--len) {
            WR_L;
            WR_H;
            WR_L;
            WR_H;
        }
#endif
#endif
    } else
        while (len--) {
            tft_Write_16(color);
        }
}

/***************************************************************************************
** Function name:           pushSwapBytePixels - for ESP32 and parallel display
** Description:             Write a sequence of pixels with swapped bytes
***************************************************************************************/
void TFT_eSPI::pushSwapBytePixels(const void* data_in, uint32_t len) {
    uint16_t* data = (uint16_t*)data_in;
    while (len--) {
        tft_Write_16(*data);
        data++;
    }
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32 and parallel display
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void* data_in, uint32_t len) {
    uint16_t* data = (uint16_t*)data_in;
    if (_swapBytes) {
        while (len--) {
            tft_Write_16(*data);
            data++;
        }
    } else {
        while (len--) {
            tft_Write_16S(*data);
            data++;
        }
    }
}

////////////////////////////////////////////////////////////////////////////////////////
#endif  // End of display interface specific functions
////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////
#if defined(ESP32_DMA) && !defined(TFT_PARALLEL_8_BIT)  //       DMA FUNCTIONS
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           dmaBusy
** Description:             Check if DMA is busy
***************************************************************************************/
bool TFT_eSPI::dmaBusy(void) {
    if (!DMA_Enabled || !spiBusyCheck) return false;

    spi_transaction_t *rtrans;
    esp_err_t ret;
    uint8_t checks = spiBusyCheck;
    for (int i = 0; i < checks; ++i) {
        ret = spi_device_get_trans_result(dmaHAL, &rtrans, 0);
        if (ret == ESP_OK) spiBusyCheck--;
    }

