m5stack/M5AtomS3/src/utility/In_eSPI_ESP32_S3.cpp
    // Serial.print("spiBusyCheck=");Serial.println(spiBusyCheck);
    if (spiBusyCheck == 0) return false;
    return true;
}

/***************************************************************************************
** Function name:           dmaWait
** Description:             Wait until DMA is over (blocking!)
***************************************************************************************/
void TFT_eSPI::dmaWait(void) {
    if (!DMA_Enabled || !spiBusyCheck) return;
    spi_transaction_t *rtrans;
    esp_err_t ret;
    for (int i = 0; i < spiBusyCheck; ++i) {
        ret = spi_device_get_trans_result(dmaHAL, &rtrans, portMAX_DELAY);
        assert(ret == ESP_OK);
    }
    spiBusyCheck = 0;
}

/***************************************************************************************
** Function name:           pushPixelsDMA
** Description:             Push pixels to TFT (len must be less than 32767)
***************************************************************************************/
// This will byte swap the original image if setSwapBytes(true) was called by
// sketch.
void TFT_eSPI::pushPixelsDMA(uint16_t *image, uint32_t len) {
    if ((len == 0) || (!DMA_Enabled)) return;

    dmaWait();

    if (_swapBytes) {
        for (uint32_t i = 0; i < len; i++)
            (image[i] = image[i] << 8 | image[i] >> 8);
    }

    esp_err_t ret;
    static spi_transaction_t trans;

    memset(&trans, 0, sizeof(spi_transaction_t));

    trans.user      = (void *)1;
    trans.tx_buffer = image;     // finally send the line data
    trans.length    = len * 16;  // Data length, in bits
    trans.flags     = 0;         // SPI_TRANS_USE_TXDATA flag

    ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
    assert(ret == ESP_OK);

    spiBusyCheck++;
}

/***************************************************************************************
** Function name:           pushImageDMA
** Description:             Push image to a window (w*h must be less than 65536)
***************************************************************************************/
// Fixed const data assumed, will NOT clip or swap bytes
void TFT_eSPI::pushImageDMA(int32_t x, int32_t y, int32_t w, int32_t h,
                            uint16_t const *image) {
    if ((w == 0) || (h == 0) || (!DMA_Enabled)) return;

    uint32_t len = w * h;

    dmaWait();

    setAddrWindow(x, y, w, h);

    esp_err_t ret;
    static spi_transaction_t trans;

    memset(&trans, 0, sizeof(spi_transaction_t));

    trans.user      = (void *)1;
    trans.tx_buffer = image;     // Data pointer
    trans.length    = len * 16;  // Data length, in bits
    trans.flags     = 0;         // SPI_TRANS_USE_TXDATA flag

    ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
    assert(ret == ESP_OK);

    spiBusyCheck++;
}

/***************************************************************************************
** Function name:           pushImageDMA
** Description:             Push image to a window (w*h must be less than 65536)
***************************************************************************************/
// This will clip and also swap bytes if setSwapBytes(true) was called by sketch
void TFT_eSPI::pushImageDMA(int32_t x, int32_t y, int32_t w, int32_t h,
                            uint16_t *image, uint16_t *buffer) {
    if ((x >= _vpW) || (y >= _vpH) || (!DMA_Enabled)) return;

    int32_t dx = 0;
    int32_t dy = 0;
    int32_t dw = w;
    int32_t dh = h;

    if (x < _vpX) {
        dx = _vpX - x;
        dw -= dx;
        x = _vpX;
    }
    if (y < _vpY) {
        dy = _vpY - y;
        dh -= dy;
        y = _vpY;
    }

    if ((x + dw) > _vpW) dw = _vpW - x;
    if ((y + dh) > _vpH) dh = _vpH - y;

    if (dw < 1 || dh < 1) return;

    uint32_t len = dw * dh;

    if (buffer == nullptr) {
        buffer = image;
        dmaWait();
    }

    // If image is clipped, copy pixels into a contiguous block
    if ((dw != w) || (dh != h)) {
        if (_swapBytes) {
            for (int32_t yb = 0; yb < dh; yb++) {
                for (int32_t xb = 0; xb < dw; xb++) {
                    uint32_t src = xb + dx + w * (yb + dy);
                    (buffer[xb + yb * dw] = image[src] << 8 | image[src] >> 8);
                }
            }
        } else {
            for (int32_t yb = 0; yb < dh; yb++) {
                memcpy((uint8_t *)(buffer + yb * dw),
                       (uint8_t *)(image + dx + w * (yb + dy)), dw << 1);
            }
        }
    }
    // else, if a buffer pointer has been provided copy whole image to the
    // buffer
    else if (buffer != image || _swapBytes) {
        if (_swapBytes) {
            for (uint32_t i = 0; i < len; i++)
                (buffer[i] = image[i] << 8 | image[i] >> 8);
        } else {
            memcpy(buffer, image, len * 2);
        }
    }

    if (spiBusyCheck) dmaWait();  // In case we did not wait earlier

    setAddrWindow(x, y, dw, dh);

    esp_err_t ret;
    static spi_transaction_t trans;

    memset(&trans, 0, sizeof(spi_transaction_t));

    trans.user      = (void *)1;
    trans.tx_buffer = buffer;    // finally send the line data
    trans.length    = len * 16;  // Data length, in bits
    trans.flags     = 0;         // SPI_TRANS_USE_TXDATA flag

    ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
    assert(ret == ESP_OK);

    spiBusyCheck++;
}

////////////////////////////////////////////////////////////////////////////////////////
// Processor specific DMA initialisation
////////////////////////////////////////////////////////////////////////////////////////

// The DMA functions here work with SPI only (not parallel)
/***************************************************************************************
** Function name:           dc_callback
** Description:             Toggles DC line during transaction
***************************************************************************************/
extern "C" void dc_callback();

void IRAM_ATTR dc_callback(spi_transaction_t *spi_tx) {
    if ((bool)spi_tx->user) {
        DC_D;
    } else {
        DC_C;
    }
}

/***************************************************************************************
** Function name:           initDMA
** Description:             Initialise the DMA engine - returns true if init OK
***************************************************************************************/
bool TFT_eSPI::initDMA(bool ctrl_cs) {
    if (DMA_Enabled) return false;

    esp_err_t ret;
    spi_bus_config_t buscfg = {
        .mosi_io_num     = TFT_MOSI,
        .miso_io_num     = TFT_MISO,
        .sclk_io_num     = TFT_SCLK,
        .quadwp_io_num   = -1,
        .quadhd_io_num   = -1,
        .max_transfer_sz = TFT_WIDTH * TFT_HEIGHT * 2 + 8,  // TFT screen size
        .flags           = 0,
        .intr_flags      = 0};

    int8_t pin = -1;
    if (ctrl_cs) pin = TFT_CS;

    spi_device_interface_config_t devcfg = {
        .command_bits     = 0,
        .address_bits     = 0,
        .dummy_bits       = 0,
        .mode             = TFT_SPI_MODE,
        .duty_cycle_pos   = 0,
        .cs_ena_pretrans  = 0,
        .cs_ena_posttrans = 0,
        .clock_speed_hz   = SPI_FREQUENCY,
        .input_delay_ns   = 0,
        .spics_io_num     = pin,
        .flags            = SPI_DEVICE_NO_DUMMY,  // 0,
        .queue_size       = 1,
        .pre_cb           = 0,  // dc_callback, //Callback to handle D/C line
        .post_cb          = 0};
    ret = spi_bus_initialize(spi_host, &buscfg, DMA_CHANNEL);
    ESP_ERROR_CHECK(ret);
    ret = spi_bus_add_device(spi_host, &devcfg, &dmaHAL);
    ESP_ERROR_CHECK(ret);

    DMA_Enabled  = true;
    spiBusyCheck = 0;
    return true;
}

/***************************************************************************************
** Function name:           deInitDMA
** Description:             Disconnect the DMA engine from SPI
***************************************************************************************/
void TFT_eSPI::deInitDMA(void) {
    if (!DMA_Enabled) return;
    spi_bus_remove_device(dmaHAL);
    spi_bus_free(spi_host);
    DMA_Enabled = false;
}

////////////////////////////////////////////////////////////////////////////////////////
#endif  // End of DMA FUNCTIONS
////////////////////////////////////////////////////////////////////////////////////////
